package Day09;

public class Day09_1 {

	//객체지향
	// 목적 : 모든형태를 코드화[자동화, AI, 요리화 등]
	
	// 프로그램에 어떤 객체르들이 필요할지 정한다
	// 객체들의 속석, 행동을 정한다
	// 객체들이 어떻게 소통할지 정한다.
	
	// 클래스 : 객체 설계
		// 멤버 : 필드(속성,메모리) 메소드(행동, 인수/ 반환) , 생성자
	// 객체 : 클래스 기반으로 서로 다른 메모리 할당받은 변수
		// 서로 다른(메모리 주소가 다름) 객체 생성
	// 상속 : 서브클래스(자식)가 슈퍼클래스(부모)의 멤버 사용
		// 목적 : 빠른 설계를 위하여 [기존 클래스로부터 멤버를 물려받아 서브클래스가 이어서 설계 하기 때문]
		// 필수x
		// java 100% 객체지향 이유 : 최상위 클래스는 Object 클래스
			// puiblic	: 전범위 	private : 현범위 
			// protected : 현패키지[패키지에 부모 클래스가 존재하면 접근 가능]	default[생략 가능]
	
}
